---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinHookOrient1Wall
source: html/934ff15e-fdd6-b18e-e3c8-2db9473ddc13.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinHookOrient1Wall Property

"Primary Bar - Hook Orientation"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinHookOrient1Wall { get; }
```